app/Controllers/Admin.php

    public function index(){
        $data['title'] =  'User List';
        $this->builder->select('users.id as userid, username, email, fullname, name');

        // mendapatkan id
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');

        // mendapatkan nama
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $query = $this->builder->get();
---
SELECT `users`.`id` as `userid`, `username`, `email`, `fullname`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`