app/Controllers/BlogAdmin.php

     public function index(){

        // instansiasi model yang mengarah ke berbagai fungsi database
        $postses = new BlogModel();
        $data['posts'] = $postses->findAll();
---
SELECT *
FROM `blog`

    public function edit($id){
        // ambil artikel yang akan diedit
        $postses = new BlogModel();
        $data['posts'] = $postses->where('id', $id)->first();
---
SELECT *
FROM `blog`
WHERE `id` = '9'
 LIMIT 1