app/Controllers/Blog.php

SELECT *
FROM `blog`
WHERE `status` = 'published'
---
    public function index(){

        // membuat object model blog
        $postses = new BlogModel();

        /*
            siapkan data untuk dikirim ke view dengan nama $posts
            dan isi datanya dengan post yang sudah terbit
        */

        // Data & Title Page
        $data['title'] = 'Personal Post';
        $data['posts'] = $postses->where('status', 'published')->findAll();