app/Libraries/Widget.php

SELECT *
FROM `blog`
---
    public function recentPost(array $params){

        // instansiasi model yang mengarah ke berbagai fungsi database
        $postses = new BlogModel();
        $data['posts'] = $postses->findAll();